# Updating Data Frames

We will go over methods for updating a `pandas.DataFrame` using Palmers Penguins


## Adding a single column ...

Start by importing packages and data.

In [1]:
import numpy as np
import pandas as pd
import random # Used for randomly generated numbers

# Set random seed
random.seed(42)

In [4]:
# Import Data
URL = 'https://raw.githubusercontent.com/allisonhorst/palmerpenguins/main/inst/extdata/penguins.csv'
penguins = pd.read_csv(URL)

## Using dictionary like syntax

Simplest way to add a new column to a Data Frame

```
df['new_col_name']= new_column_values 
```
If the column name exists, then the existing column will be updated. The syntax is the same, we simply reassign the variable to a new name.

In [5]:
penguins.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,male,2007
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,female,2007
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,female,2007
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,2007
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,female,2007

## Example

Create a new column where the body mass is in kg instead of grams

In [6]:
# Add a new column body_mass_kg
penguins['body_mass_kg']= penguins['body_mass_g']/1000

In [8]:
# Confirm the new column is in the data frame 
print('body_mass_kg' in penguins.columns)

# Look at the new column
penguins.head()

True

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year,body_mass_kg
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,male,2007,3.75
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,female,2007,3.80
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,female,2007,3.25
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,2007,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,female,2007,3.45

## Using the `assign()` method

We can also create or update an existing column using `assign()`:

```
df= df.assign(new_col_name= new_column_value)
```

## Example

Give each penguin observation a unique identifier as a three digit number, add this column at the beginning of the data frame

In [13]:
# Create unique random 3-digit codes 
codes= random.sample(range(100, 1000), len(penguins))

# Insert codes at the front of the data frame
penguins.insert(loc= 0,
               column= 'id_code',
               value=codes)

penguins.head()

,id_code,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year,body_mass_kg
0,201,Adelie,Torgersen,39.1,18.7,181.0,3750.0,male,2007,3.75
1,802,Adelie,Torgersen,39.5,17.4,186.0,3800.0,female,2007,3.80
2,476,Adelie,Torgersen,40.3,18.0,195.0,3250.0,female,2007,3.25
3,657,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,2007,NaN
4,760,Adelie,Torgersen,36.7,19.3,193.0,3450.0,female,2007,3.45

## Adding multiple columns

Use `assign()` to create or update multiple columns at once

### Example

We want to add these columns:
- Flipper length converted from mm to cm
- A code representing the observer

In [15]:
# Create the new columns
penguins= penguins.assign(flipper_length_cm= penguins['flipper_length_mm']/10,
                         observer= random.choices(['A', 'B', 'C'], k= len(penguins)))
penguins.head()

,id_code,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year,body_mass_kg,flipper_length_cm,observer
0,201,Adelie,Torgersen,39.1,18.7,181.0,3750.0,male,2007,3.75,18.1,B
1,802,Adelie,Torgersen,39.5,17.4,186.0,3800.0,female,2007,3.80,18.6,C
2,476,Adelie,Torgersen,40.3,18.0,195.0,3250.0,female,2007,3.25,19.5,C
3,657,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,2007,NaN,NaN,B
4,760,Adelie,Torgersen,36.7,19.3,193.0,3450.0,female,2007,3.45,19.3,A

## Removing columns

Remove columns using the `drop()` method:

```
df= df.drop(column= col_names)
```
col_names can be a single name or a list

In [17]:
penguins= penguins.drop(columns= ['flipper_length_mm', 'body_mass_g'])

penguins.head()

,id_code,species,island,bill_length_mm,bill_depth_mm,sex,year,body_mass_kg,flipper_length_cm,observer
0,201,Adelie,Torgersen,39.1,18.7,male,2007,3.75,18.1,B
1,802,Adelie,Torgersen,39.5,17.4,female,2007,3.80,18.6,C
2,476,Adelie,Torgersen,40.3,18.0,female,2007,3.25,19.5,C
3,657,Adelie,Torgersen,NaN,NaN,NaN,2007,NaN,NaN,B
4,760,Adelie,Torgersen,36.7,19.3,female,2007,3.45,19.3,A

## Updating specific values in our data frame

 Sometimes we want to update specific values in our data frame
 
 ### A single value
 
 Access a single value in a data frame using the locators:
 - `at[]` to select labels
 - `iat[]` to select by position
 
 ```
 df.at[single_value_index, 'column_name']
 ```
 
 ## Example

In [18]:
penguins= penguins.set_index('id_code')

penguins

,species,island,bill_length_mm,bill_depth_mm,sex,year,body_mass_kg,flipper_length_cm,observer
id_code,,,,,,,,,
201,Adelie,Torgersen,39.1,18.7,male,2007,3.750,18.1,B
802,Adelie,Torgersen,39.5,17.4,female,2007,3.800,18.6,C
476,Adelie,Torgersen,40.3,18.0,female,2007,3.250,19.5,C
657,Adelie,Torgersen,NaN,NaN,NaN,2007,NaN,NaN,B
760,Adelie,Torgersen,36.7,19.3,female,2007,3.450,19.3,A
...,...,...,...,...,...,...,...,...,...
430,Chinstrap,Dream,55.8,19.8,male,2009,4.000,20.7,B
423,Chinstrap,Dream,43.5,18.1,female,2009,3.400,20.2,A
254,Chinstrap,Dream,49.6,18.2,male,2009,3.775,19.3,A
550,Chinstrap,Dream,50.8,19.0,male,2009,4.100,21.0,B
169,Chinstrap,Dream,50.2,18.7,female,2009,3.775,19.8,B

What was the bill length of the penguin with ID # 657?

In [19]:
# Check bill length of 657
penguins.at[657, 'bill_length_mm']

nan

In [22]:
# Update this value to 38.3 mm, using at[]
penguins.at[657, 'bill_length_mm'] = 38.3

# Confirm value was updated
penguins.loc[657]

species                 Adelie
island               Torgersen
bill_length_mm            38.3
bill_depth_mm              NaN
sex                        NaN
year                    2007.0
body_mass_kg               NaN
flipper_length_cm          NaN
observer                     B
Name: 657, dtype: object


If we want to update or access a single value by position we use `iat[]` locator:

```
df.iat[index_integer_location, column_integer_location]
```
or

```
df.columns.get_loc('column_name')
```

In [33]:
# Get the position of the bill_length_mm column
bill_length_index= penguins.columns.get_loc('bill_length_mm')

In [34]:
penguins.iat[3, bill_length_index]= np.nan

In [35]:
penguins.iloc[3]

species                 Adelie
island               Torgersen
bill_length_mm             NaN
bill_depth_mm              NaN
sex                        NaN
year                    2007.0
body_mass_kg               NaN
flipper_length_cm          NaN
observer                     B
Name: 657, dtype: object

## Update multiple values in a column

What if we want to update multiple values in a column?

### Using a condition
 When we need to create a new column where the new values depend on conditions on another column.
 
#### Example

We want to classify penguins by:

- penguins with body mass < 3 kg are small
- penguins with 3 kg <= body mass < 5 kg are medium
- penguins with 5kg <= body mass are large

We will use `numpy.select()`

In [38]:
conditions = [penguins.body_mass_kg < 3,
             (3<= penguins.body_mass_kg) & (penguins.body_mass_kg<5),
             5 <= penguins.body_mass_kg]

# Create a list with choices
choices= ['small', 'medium', 'large']

penguins['size'] = np.select(conditions,
                          choices,
                          default= np.nan)

## By selecting values and then updating them

```
df.loc[row_selection, column_name]= new_names
```

- `row_selection`: the rwos we want to update 
- `col_name`: a single column name
- `new_names`: the new value or values that we want. If using multiple values, then the new_values must be of the same length as the rows selected

Using `iloc[]` in assignment modifies the data frame without the need for direct reassignment

### Example

Update the 'male' values in the sex column to 'M'

In [41]:
# Selecting the male rows and renaming
penguins.loc[penguins.sex== 'male', 'sex']= 'M'

In [42]:
# Check the changes in the sex column
print(penguins.sex.unique())

['M' 'female' nan]

### Best practices 

We want to similarly update the 'female' values in the sex column to 'F'. We might try to do it this way

In [43]:
penguins[penguins.sex=='female']['sex']= 'F'

/tmp/ipykernel_1686596/4188309669.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  penguins[penguins.sex=='female']['sex']= 'F'

The use of double brackets to subset is called **chained indexing**.

When we select the data that way that we want to update, we will recieve a warning to use `loc[]` instead

The warning is to let us know that it didn't update the original data frame

In [44]:
penguins['sex'].unique()

array(['M', 'female', nan], dtype=object)

**Avoid chained `[][]` and use .loc[] instead** 
This warning often arises from chained indexing

Update the 'female' values in the penguins data frame without using the chained index method

In [46]:
# No chain indexing 
penguins.loc[penguins.sex== 'female', 'sex']= 'F'

In [47]:
penguins['sex'].unique()

array(['M', 'F', nan], dtype=object)